soffolk/railscast115/app/views/comments/_comment.slim

INSERT INTO `comments` (`commentable_id`, `commentable_type`, `content`, `created_at`, `updated_at`, `user_id`) VALUES (2, 'Mission', '测试评论', '2013-08-11 00:53:16', '2013-08-11 00:53:16', 1)
---
      span.time_ago
        = "#{time_ago_in_words comment.created_at}前"
    .content