soffolk/railscast115/app/controllers/comments_controller.rb

  def create
    @mission = Mission.find(params[:mission_id])
    @comment = @mission.comments.build(comment_params)
    @comment.user = current_user

    if @comment.save
      @mission.events.create(user: current_user, action: "comment")
---
SELECT `missions`.* FROM `missions` WHERE `missions`.`id` = 2 ORDER BY `missions`.`id` ASC LIMIT 1
INSERT INTO `comments` (`commentable_id`, `commentable_type`, `content`, `created_at`, `updated_at`, `user_id`) VALUES (2, 'Mission', '测试评论', '2013-08-11 00:53:16', '2013-08-11 00:53:16', 1)
INSERT INTO `events` (`action`, `created_at`, `eventable_id`, `eventable_type`, `updated_at`, `user_id`) VALUES ('comment', '2013-08-11 00:53:17', 2, 'Mission', '2013-08-11 00:53:17', 1)