soffolk/railscast115/app/controllers/missions_controller.rb

  def show
    @latest_missions = Mission.cache("latest_mission") do
      Mission.order("id desc").limit(10)
---
SELECT `missions`.* FROM `missions` ORDER BY id desc LIMIT 10

  def create
    @mission = Mission.new(mission_params)
    @mission.creator = current_user
    @mission.status = 0

    if @mission.save
---
INSERT INTO `missions` (`created_at`, `creator_id`, `description`, `name`, `status`, `updated_at`) VALUES ('2013-08-02 17:06:51', 1, 'sss', '新建', 1, '2013-08-02 17:06:51')