soffolk/railscast115/app/controllers/session_controller.rb

INSERT INTO `users` (`created_at`, `email`, `github_homepage`, `nickname`, `provider`, `uid`, `updated_at`) VALUES ('2013-07-31 15:45:44', 'zlx.star@gmail.com', 'https://github.com/zlx', 'zlx', 'github', 1835854, '2013-07-31 15:45:44')
---
  def auth
    @user = User.find_or_create_from_auth_hash(auth_hash)