soffolk/railscast115/app/controllers/teams_controller.rb

  def create
    if @team.save
---
INSERT INTO `teams` (`avatar_url`, `created_at`, `description`, `name`, `updated_at`) VALUES ('ssss', '2013-08-02 14:29:51', 'team1 description', 'team1', '2013-08-02 14:29:51')

  def update
    if @team.update_attributes(team_params)
---
UPDATE `teams` SET `name` = 'team1 ＋ 1', `updated_at` = '2013-08-02 14:41:27' WHERE `teams`.`id` = 2

  def join
    @team.users << current_user
    if @team.save
---
UPDATE `users` SET `team_id` = 5, `updated_at` = '2013-08-02 15:03:16' WHERE `users`.`id` = 1

  def destroy
    @team.destroy
---
DELETE FROM `teams` WHERE `teams`.`id` = 1