soffolk/railscast115/app/views/teams/show.slim

      .thumbnails
        - @team.cache_users.each do |user|
          .thumbnail.span2.box
---
SELECT `users`.* FROM `users` WHERE `users`.`team_id` = 2